In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import datetime as dt

In [ ]:
pd.set_option("display.max_columns",None);
pd.set_option("display.max_rows",None);

In [ ]:
retail = pd.read_excel("online_retail_II.xlsx", sheet_name="Year 2010-2011")

In [ ]:
df = retail.copy()

In [ ]:
df.head(3)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom

In [ ]:
df.tail(3)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France
541909,581587,POST,POSTAGE,1,2011-12-09 12:50:00,18.00,12680.0,France

In [ ]:
# info about dataframe

In [ ]:
df["Country"].value_counts()

United Kingdom          495478
Germany                   9495
France                    8558
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

In [ ]:
#  country number

In [ ]:
df["Country"].nunique()

38

In [ ]:
for i in df.columns:
  print(i, df[i].nunique())

Invoice 25900
StockCode 4070
Description 4223
Quantity 722
InvoiceDate 23260
Price 1630
Customer ID 4372
Country 38

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541910 entries, 0 to 541909
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      541910 non-null  object
 1   StockCode    541910 non-null  object
 2   Description  540456 non-null  object
 3   Quantity     541910 non-null  int64
 4   InvoiceDate  541910 non-null  datetime64[ns]
 5   Price        541910 non-null  float64
 6   Customer ID  406830 non-null  float64
 7   Country      541910 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [ ]:
 # check null values

In [ ]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
Price               0
Customer ID    135080
Country             0
dtype: int64

In [ ]:
df.shape

(541910, 8)

In [ ]:
df.isnull().sum().sum()/df.shape[0]    # ratio of total null values and total row

0.2519495857245668

In [ ]:
df.size

4335280

In [ ]:
# add new column . Total price column , to see how much customers  paid

In [ ]:
df["total-price"] = df["Quantity"]*df["Price"]

In [ ]:
df.head()  # lokk new column

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total-price
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [ ]:
# Now we use groupby to see total payment per customer

In [ ]:
df.groupby("Customer ID").agg({"total-price":"sum"}).head()

             total-price
Customer ID
12346.0             0.00
12347.0          4310.00
12348.0          1797.24
12349.0          1757.55
12350.0           334.40

In [ ]:
# This is a invoice dataset. But we see 0 total price value here. How it can be ? Let's take a closer look at this.

In [ ]:
df[df["Customer ID"]==12346.0]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total-price
61619,541431,23166,MEDIUM CERAMIC TOP STORAGE JAR,74215,2011-01-18 10:01:00,1.04,12346.0,United Kingdom,77183.6
61624,C541433,23166,MEDIUM CERAMIC TOP STORAGE JAR,-74215,2011-01-18 10:17:00,1.04,12346.0,United Kingdom,-77183.6

In [ ]:
# Customer bought sth but then customer returned it.

In this dataset Invoice IDs which starts with C letter shows that it is a return invoice.

For this analysis I will delete return invoices. Because it doesnt change that he/she preferred us.

We can use different ways for this problem  but I will chosee this one for now bcs I dont know others :)

In [ ]:
# to see returned invoices

In [ ]:
df[df["Invoice"].astype("str").str.get(0)=="C"].head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total-price
141,C536379,D,Discount,-1,2010-12-01 09:41:00,27.50,14527.0,United Kingdom,-27.50
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,2010-12-01 09:49:00,4.65,15311.0,United Kingdom,-4.65
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,2010-12-01 10:24:00,1.65,17548.0,United Kingdom,-19.80
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom,-6.96
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom,-6.96

In [ ]:
#  Or we can choose the total price value as those less than zero

In [ ]:
# Now we choose normal invoices

In [ ]:
df[df["Invoice"].astype("str").str.get(0)!="C"].head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total-price
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [ ]:
df = df[df["Invoice"].astype("str").str.get(0)!="C"]

In [ ]:
# I know na rows ratio is big. We can use different ways to overcome missing values. 
# For this analysis I will drop them.

In [ ]:
df = df.dropna()

In [ ]:
# This is our new dataFrame

In [ ]:
df["Customer ID"]=df["Customer ID"].astype("int")   # Change customer ID values to int.

## **Recency**

In [ ]:
 # First we should determine  analysis date

In [ ]:
df["InvoiceDate"].max()

Timestamp('2011-12-09 12:50:00')

In [ ]:
today_date=dt.datetime(2011,12,9)  # I choose last Invoicedate as my analysis date

In [ ]:
 # now use groupby to customerID( bcs there may be many invoice per user) and choose InvoiceDate max bcs
 # the last time it came is important to recency

In [ ]:
df.groupby("Customer ID").agg({"InvoiceDate": "max"}).head()

                    InvoiceDate
Customer ID
12346       2011-01-18 10:01:00
12347       2011-12-07 15:52:00
12348       2011-09-25 13:13:00
12349       2011-11-21 09:51:00
12350       2011-02-02 16:01:00

In [ ]:
# Now substract max date values and our analysis date

In [ ]:
rec = today_date-df.groupby("Customer ID").agg({"InvoiceDate": "max"})

In [ ]:
rec.head()

                  InvoiceDate
Customer ID
12346       324 days 13:59:00
12347         1 days 08:08:00
12348        74 days 10:47:00
12349        17 days 14:09:00
12350       309 days 07:59:00

In [ ]:
# clear data time
# List Compheresion

In [ ]:
rec["InvoiceDate"]=[i.days for i in rec["InvoiceDate"]]

In [ ]:
rec.head()  #Now we see date time as day

             InvoiceDate
Customer ID
12346                324
12347                  1
12348                 74
12349                 17
12350                309

In [ ]:
rec.rename(columns={"InvoiceDate": "Recency"},inplace=True)

In [ ]:
rec.head()

             Recency
Customer ID
12346            324
12347              1
12348             74
12349             17
12350            309

# **Frequency**

In [ ]:
# how many times have they bought something

In [ ]:
df.groupby("Customer ID").agg({"Invoice":"nunique"}).head(10)

             Invoice
Customer ID
12346              1
12347              7
12348              4
12349              1
12350              1
12352              8
12353              1
12354              1
12355              1
12356              3

In [ ]:
freq = df.groupby("Customer ID").agg({"Invoice":"nunique"})

In [ ]:
freq = freq.rename(columns={"Invoice":"Frequency"})

In [ ]:
freq.head()

             Frequency
Customer ID
12346                1
12347                7
12348                4
12349                1
12350                1

# **Monetary**

In [ ]:
money = df.groupby("Customer ID").agg({"total-price":"sum"}).rename(columns={"total-price":"Monetary"})

In [ ]:
money.head()

             Monetary
Customer ID
12346        77183.60
12347         4310.00
12348         1797.24
12349         1757.55
12350          334.40

# **RFM**

In [ ]:
# check shapes

In [ ]:
print(rec.shape, freq.shape, money.shape)

(4339, 1) (4339, 1) (4339, 1)

In [ ]:
# concat rec , freq and money

In [ ]:
rfm  = pd.concat([rec,freq,money], axis=1)

In [ ]:
rfm.head()

             Recency  Frequency  Monetary
Customer ID
12346            324          1  77183.60
12347              1          7   4310.00
12348             74          4   1797.24
12349             17          1   1757.55
12350            309          1    334.40

In [ ]:
# determine range

In [ ]:
rfm["Recency-Score"] = pd.qcut(rfm["Recency"],5,labels=[5,4,3,2,1] ) # bcs It is positive that the customer has recently bought sth

In [ ]:
rfm["Frequency-Score"] = pd.qcut(rfm["Frequency"].rank(method="first"),5,labels=[1,2,3,4,5] )

In [ ]:
rfm["Monetary-Score"] = pd.qcut(rfm["Monetary"],5,labels=[1,2,3,4,5] )

In [ ]:
rfm.head()

,Recency,Frequency,Monetary,Frequency-Score,Monetary-Score,Recency-Score
Customer ID,,,,,,
12346,324,1,77183.60,1,5,1
12347,1,7,4310.00,5,5,5
12348,74,4,1797.24,4,4,2
12349,17,1,1757.55,1,4,4
12350,309,1,334.40,1,2,1

In [ ]:
rfm["RFM"]= rfm["Recency-Score"].astype("str")+rfm["Monetary-Score"].astype("str")+rfm["Recency-Score"].astype("str")

In [ ]:
rfm.head()

,Recency,Frequency,Monetary,Frequency-Score,Monetary-Score,Recency-Score,RFM
Customer ID,,,,,,,
12346,324,1,77183.60,1,5,1,151
12347,1,7,4310.00,5,5,5,555
12348,74,4,1797.24,4,4,2,242
12349,17,1,1757.55,1,4,4,444
12350,309,1,334.40,1,2,1,121

# **Define Groups**

In [ ]:
# u can see these groups in rfm table
# this func is about recency and frequency

In [ ]:
segmnt_map = {r'[1-2][1-2]' : "Hibernating"      ,
              r'[1-2][3-4]' :  "At Risk"         ,
              r'[1-2]5'     :  "Can't Lose"      ,
              r'3[1-2]'     :"About to Sleep"    ,
              r'33'         :"Need Attention"    ,
              r'[3-4][4-5]' :"Loyal Customers"   ,
              r'41'         :"Promising"         ,
              r'51'         :"New Customers"     ,
              r'[4-5][2-3]' :"Potential Loyalist",
              r'5[4-5]'     :"Champions"     
}

In [ ]:
rfm["Segment"] = rfm["Recency-Score"].astype("str")+rfm["Frequency-Score"].astype("str")

In [ ]:
rfm["Segment"] = rfm["Segment"].replace(segmnt_map,regex=True)

In [ ]:
rfm.head()

,Recency,Frequency,Monetary,Frequency-Score,Monetary-Score,Recency-Score,RFM,Segment
Customer ID,,,,,,,,
12346,324,1,77183.60,1,5,1,151,Hibernating
12347,1,7,4310.00,5,5,5,555,Champions
12348,74,4,1797.24,4,4,2,242,At Risk
12349,17,1,1757.55,1,4,4,444,Promising
12350,309,1,334.40,1,2,1,121,Hibernating

In [ ]:
rfm[["Segment","Recency","Frequency","Monetary"]].head()

                 Segment  Recency  Frequency  Monetary
Customer ID
12346        Hibernating      324          1  77183.60
12347          Champions        1          7   4310.00
12348            At Risk       74          4   1797.24
12349          Promising       17          1   1757.55
12350        Hibernating      309          1    334.40

In [ ]:
rfm[["Segment","Recency","Frequency","Monetary"]].groupby("Segment").agg(["min","max","mean","count"])

                   Recency                        Frequency                  \
                       min  max        mean count       min  max       mean
Segment
About to Sleep          32   70   51.312500   352         1    2   1.161932
At Risk                 71  372  151.785835   593         2    6   2.878583
Can't Lose              71  371  130.968254    63         6   34   8.380952
Champions               -1   11    4.361769   633         3  210  12.417062
Hibernating             71  372  215.605042  1071         1    2   1.101774
Loyal Customers         13   70   31.608059   819         3   63   6.479853
Need Attention          32   70   50.427807   187         2    3   2.326203
New Customers           -1   11    5.428571    42         1    1   1.000000
Potential Loyalist      -1   31   15.398760   484         1    3   2.010331
Promising               13   31   21.421053    95         1    1   1.000000

                         Monetary
                   count      min        max         mean count
Segment
About to Sleep       352     6.20    6207.67   471.994375   352
At Risk              593    52.00   44534.30  1084.535297   593
Can't Lose            63    70.02   10254.18  2796.155873    63
Champions            633   201.12  280206.02  6857.963918   633
Hibernating         1071     3.75   77183.60   488.643307  1071
Loyal Customers      819    36.56  124914.53  2864.247791   819
Need Attention       187     6.90   12601.83   897.627861   187
New Customers         42    89.94    3861.00   388.212857    42
Potential Loyalist   484    20.80  168472.50  1041.222004   484
Promising             95     0.00    1757.55   290.913158    95

In [ ]:
# After that  we can make analysis with this table.
# about when they came for last time (mean), total money for each segment etc.

In [ ]:
#Please feel free to ask sth about this notebook.  I m so new we can learn together :)